jack77er/openUTRUSTA/Packages/.cache/Keil.EZR32LG_DFP.1.0.0.pdsc
  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="emlib" doc="emlib\doc\html\index.html">Silicon Labs EFM32 emlib Peripheral Library</description>
  </taxonomy>

  <components>
    <!-- Startup EZR32LG -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.20.13" condition="EZR32LG CMSIS">
      <description>System Startup for Silicon Labs EZR32LG device series</description>
      <files>
        <file category="include" name="Device\EZR32LG\Include\"/>
        <file category="source"  name="Device\EZR32LG\Source\ARM\startup_ezr32lg.s" attr="config" version="3.20.13" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\EZR32LG\Source\GCC\startup_ezr32lg.S" attr="config" version="3.20.13" condition="Compiler GCC"  />
        <file category="source"  name="Device\EZR32LG\Source\system_ezr32lg.c"      attr="config" version="3.20.13"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"  name="RTE_Driver\Config\RTE_Device.h" attr="config" version="2.00"/-->
      </files>
    </component>

    <component Cclass="Device" Cgroup="emlib" Csub="Framework" Cversion="3.20.13" condition="EZR32LG">
      <description>emlib Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="header"  name="emlib\inc\em_common.h"/>
        <file category="header"  name="emlib\inc\em_chip.h"/>
        <file category="header"  name="emlib\inc\em_bitband.h"/>
        <file category="header"  name="emlib\inc\em_version.h"/>
        <file category="header"  name="emlib\inc\em_assert.h"/>
        <file category="source"  name="emlib\src\em_assert.c"/>
      </files>
    </component>
  </components>

</package>
